Revit 2024 API
ExternalResourceUtils.GetAllExternalResourceReferences Method
Overload List
Name | Description
GetAllExternalResourceReferences(Document)
 Gets the ids of all elements which refer to external resources.
GetAllExternalResourceReferences(Document, ExternalResourceType)
 Gets the ids of all elements which refer to a specific type of external resource.
See Also
ExternalResourceUtils Class
ExternalResourceUtils Members
Autodesk.Revit.DB Namespace